import 'package:flutter/animation.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

const kwhitecolor = Colors.white;

const kblackcolor = Colors.black;

const kgreycolor = Color.fromARGB(255, 158, 158, 158);
const kashcolor = Color.fromARGB(255, 233, 233, 233);

final heigh10 = SizedBox(height: 10.w);
final heigh20 = SizedBox(height: 20.w);
final heigh5 = SizedBox(height: 5.w);

const ktext =
    'നേപ്പാൾ വിമാന ദുരന്തം; ഇതുവരെ 68 മരണം, ബ്ലാക്ക് ബോക്സ് കണ്ടെത്തി';
const ktextnews =
    'കഴിഞ്ഞ മുപ്പത് വർഷത്തിനിടയിൽ നേപ്പാൾ കണ്ട ഏറ്റവും വലിയ വിമാന ദുരന്തത്തിൽ ഇതുവരെ 68 മൃതദേഹങ്ങൾ കണ്ടെത്തി. ലാൻഡിങ്ങിന് തൊട്ടു മുൻപാണ് യതി എയർലൈൻസിന്റെ എടിആർ 72 എന്ന ഇരട്ട എഞ്ചിൻ വിമാനം തകർന്നുവീണത്. നേപ്പാൾ തലസ്ഥാനമായ കാഠ്മണ്ഡുവിൽ നിന്നും പൊഖാറയിലേക്ക് വരുകയായിരുന്നു വിമാനം. പൊഖാറ വിമാനത്താവളത്തിലെ റൺവേയിലാണ് വിമാനം തകർന്ന് വീണത്. തകർന്ന് വീണയുടൻ തന്നെ വിമാനത്തിന് തീ പിടിച്ചതാണ് ദുരന്തത്തിന്റെ വ്യാപ്തി വർദ്ധിപ്പിച്ചത്. അപകട സ്ഥലത്ത് നിന്ന് ഇതുവരെ ആരെയും രക്ഷിക്കാൻ കഴിഞ്ഞില്ലെന്ന് നേപ്പാൾ ആർമി വക്താവ് കൃഷ്ണ പ്രസാദ് ഭണ്ഡാരി മാധ്യമങ്ങളോട് പറഞ്ഞു. അഞ്ച് ഇന്ത്യക്കാരടക്കം ആകെ 72 പേരാണ് വിമാനത്തിൽ ഉണ്ടായിരുന്നത്. നാല് പേർക്ക് വേണ്ടി ഊർജിതമായ തിരച്ചിൽ നടക്കുന്നുണ്ട്. ദുരന്തത്തിൽ അനുശോചിച്ച് നേപ്പാൾ ഇന്ന് ദേശീയ ദുഃഖാചരണം പ്രഖ്യാപിച്ചിട്ടുണ്ട്.';
